/*
○ 직원 관리 프로그램을 구현한다.
   - 데이터베이스 연동 프로그램으로 작성한다.
   - MemberDTO, MemberDAO 를 활용한다.
   - 메뉴 구성 및 기능을 구현한다.→ Process
   
실행 예)

=====[ 직원 관리 ]=====
1. 직원 정보 입력
2. 직원 전체 출력
	- 사번 정렬
	- 이름 정렬
	- 부서 정렬
	- 직위 정렬
	- 급여 내림차순 정렬
3. 직원 검색 출력
	- 사번 검색
	- 이름 검색
	- 부서 검색
	- 직위 검색
4. 직원 정보 수정
5. 직원 정보 삭제
=======================
>> 메뉴 선택(1~5, 『-1』 종료) : 1

직원 정보 입력 ------------------------------------------------------------
이름 : 김정용
주민등록번호(yymmdd-nnnnnnn) : 960608-2234567
입사일(yyyy-mm-dd) : 2019-06-08
지역(강원/경기/경남/경북/부산/서울/인천/전남/전북/제주/충남/충북) : 경기
전화번호 : 010-1111-1111
부서(개발부/기획부/영업부/인사부/자재부/총무부/홍보부) : 개발부 
직위(사장/전무/상무/이사/부장/차장/과장/대리/사원) : 대리
기본급 (최소 1800000 이상) : 5000000
수당 : 2000000

직원 정보 입력 완료.
------------------------------------------------------------- 직원 정보 입력

=====[ 직원 관리 ]=====
1. 직원 정보 입력
2. 직원 전체 출력
	- 사번 정렬
	- 이름 정렬
	- 부서 정렬
	- 직위 정렬
	- 급여 내림차순 정렬
3. 직원 검색 출력
	- 사번 검색
	- 이름 검색
	- 부서 검색
	- 직위 검색
4. 직원 정보 수정
5. 직원 정보 삭제
=======================
>> 메뉴 선택(1~5, 『-1』 종료) : 2

1. 사번 정렬
2. 이름 정렬
3. 부서 정렬
4. 직위 정렬
5. 급여 내림차순 정렬
>> 선택(1~5, 『-1』 종료) : -1

=====[ 직원 관리 ]=====
1. 직원 정보 입력
2. 직원 전체 출력
	- 사번 정렬
	- 이름 정렬
	- 부서 정렬
	- 직위 정렬
	- 급여 내림차순 정렬
3. 직원 검색 출력
	- 사번 검색
	- 이름 검색
	- 부서 검색
	- 직위 검색
4. 직원 정보 수정
5. 직원 정보 삭제
=======================
>> 메뉴 선택(1~5, 『-1』 종료) : 2

1. 사번 정렬
2. 이름 정렬
3. 부서 정렬
4. 직위 정렬
5. 급여 내림차순 정렬
>> 선택(1~5, 『-1』 종료) : 1

전체 인원 : xx명
사번  이름  주민번호  입사일  지역  전화번호  부서  직위  기본급  수당  급여
1001
1002
1003									...
  :
1060


=====[ 직원 관리 ]=====
1. 직원 정보 입력
2. 직원 전체 출력
	- 사번 정렬
	- 이름 정렬
	- 부서 정렬
	- 직위 정렬
	- 급여 내림차순 정렬
3. 직원 검색 출력
	- 사번 검색
	- 이름 검색
	- 부서 검색
	- 직위 검색
4. 직원 정보 수정
5. 직원 정보 삭제
=======================
>> 메뉴 선택(1~5, 『-1』 종료) : 3

1. 사번 검색
2. 이름 검색
3. 부서 검색
4. 직위 검색
>> 선택(1~4, 『-1』 종료) : 4

검색할 사번 입력 : ...

...

=====[ 직원 관리 ]=====
1. 직원 정보 입력
2. 직원 전체 출력
	- 사번 정렬
	- 이름 정렬
	- 부서 정렬
	- 직위 정렬
	- 급여 내림차순 정렬
3. 직원 검색 출력
	- 사번 검색
	- 이름 검색
	- 부서 검색
	- 직위 검색
4. 직원 정보 수정
5. 직원 정보 삭제
=======================
>> 메뉴 선택(1~5, 『-1』 종료) : -1

프로그램이 종료되었습니다.
*/
package com.test;

import java.sql.Connection;
import java.sql.SQLException;
import java.util.Scanner;

import com.util.DBConn;

public class Process
{
	// 주요 변수 선언
	MemberDAO dao;
	
	//생성자
	public Process()
	{
		dao = new MemberDAO();
	}
/*
 * 직원 정보 입력 ------------------------------------------------------------
이름 : 김정용
주민등록번호(yymmdd-nnnnnnn) : 960608-2234567
입사일(yyyy-mm-dd) : 2019-06-08
지역(강원/경기/경남/경북/부산/서울/인천/전남/전북/제주/충남/충북) : 경기
전화번호 : 010-1111-1111
부서(개발부/기획부/영업부/인사부/자재부/총무부/홍보부) : 개발부 
직위(사장/전무/상무/이사/부장/차장/과장/대리/사원) : 대리
기본급 (최소 1800000 이상) : 5000000
수당 : 2000000

직원 정보 입력 완료.
------------------------------------------------------------- 직원 정보 입력
 * */	
	//1. 직원 정보 입력
	public void empInsert() throws SQLException
	{
		//연결하기
		dao.connection();
		
		//주요 변수 선언
		Scanner sc = new Scanner(System.in);
		String name, ssn,ibsa,city,tel,buseo,jikwi,basicpay,sudang;
		int result = 0;
		
		//입력받기
		System.out.println("직원 정보 입력 ------------------------------------------------------------");
		System.out.print("이름 : ");
		name = sc.next();
		System.out.print("주민등록번호(yymmdd-nnnnnnn) : ");
		ssn = sc.next();
		System.out.print("입사일(yyyy-mm-dd) : ");
		ibsa = sc.next();
		System.out.print("지역 : "); //!!
		city = sc.next();
		System.out.print("전화번호 : ");
		tel = sc.next();
		System.out.print("부서 : "); //!!
		buseo = sc.next();
		System.out.print("직위 : "); //!!
		jikwi = sc.next();
		System.out.print("기본급 : "); //!!
		basicpay = sc.next();
		System.out.print("수당 : ");
		sudang = sc.next();
		System.out.println("------------------------------------------------------------- 직원 정보 입력");
		
		
		//dto 생성
		MemberDTO dto = new MemberDTO();
		
		dto.setName(name);
		dto.setSsn(ssn);
		dto.setIbsadate(ibsa);
		dto.setCity(city);
		dto.setTel(tel);
		dto.setBuseo(buseo);
		dto.setJikwi(jikwi);
		dto.setBasicpay(basicpay);
		dto.setSudang(sudang);
		
		//dao 함수 호출
		result = dao.insert(dto);
		
		if (result > 0)
		{
			System.out.println(">>직원 정보 입력 완료.");
		}
		else
		{
			System.out.println("직원 정보가 입력되지 않았습니다.");
		}
		
	}//end empInsert()
	
	
	
	
	
	
	
	
	
	
	//2. 직원 전체 출력(사번,이름,부서,직위,급여 내림차순 정렬)
	//3. 직원 검색 출력(사번,이름,부서,직위)
	//4. 직원 정보 수정
	//5. 직원 정보 삭제
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
}
